package com.gkq.agin.util;

public class StringUtil {

 public void test(){
            String str1="357508/15301290/15300692/15300291/15299798/15297956/15293640/15288778/15288777/15288775/15286921/15286921/15286921/15286920/15282332/15282331/15265719/15237586/15201503/15189173/14989838/14966993/14964647/14881400/14851644/14816950/14808368/14808368/14757090/14757089/14729434/14600925/14416540/14264392/14264391/14236772/14242982/14242980/14139460/14139462/14139462/13882506/13871612/13620554/13530728/13525718/13522557/13098181/12778960/12143213/12143213/12088163/11480941/10900812/10644278/10644198/10474448/10322994/8065820/7519031/6578485/4591444/1258143/3529247/2272006/2244628/1595052/1455877/1388793/1388793/1344344/1334998/753014";
            String str2=" 华润南京/华能如海风电/华能苏州燃机/广恒东台风电/华能六合风电/国信大中风电/无锡西区燃机/华电滨海风电/中电二洪风电/华能铜山风电/广核射阳风电/广核射阳风电/广核射阳风电/高邮协合风电/长江响海风电/苏美热电/广核如海风电/亿晶直溪光伏/龙源黄海风电/国信黄海风电/金湖正辉光伏/泗洪协合风电/中电贾汪风电/舜大宝应光伏/旭强响水光伏/天合响水光伏/阳城电厂/阳城电厂/华电李中光伏/华电沙沟光伏/王子热电/国信临海风电/实联热电/金湖振合光伏/高邮振兴光伏/泗洪天岗光伏/苏州康盛风电/华润如东风电/华能如东风电/中电滨海风电/中电滨海风电/国信靖江电厂/句容电厂/龙源盱眙风电/碧溪电厂/大唐吴江/北部燃机/龙源大丰风电/吴江热电/淮安燃机/淮安燃机/仪征燃机/戚燃热电/龙源如海风电/亚太电厂/华能太仓/国华东台风电/华电灌云风电/国华射阳风电/国信东凌风电/长江响水风电/华能启东风电/天裕电厂/中电大丰风电/泰兴热电/龙源如东风电/联能如东风电/常州电厂/蓝天燃机/蓝天燃机/沙洲电厂/徐州二厂/常熟二厂";
            String str3="";
            String arr1[]=str1.split("/");
            String arr2[]=str2.split("/");
            for(int i=0;i<arr1.length;i++){
                str3="update SD_FDJT.DC_FDGS set dc_id="+arr1[i]+" where dcjc='"+arr2[i]+"'";
                System.out.print(str3+";"+"\n");

            }
        }

        public static void main(String[] args){
            StringUtil t=new StringUtil();
            t.test();
        }



    }



